Revit 2024 API
DividedPath.TotalPathLength Property
 The sum of the curve lengths.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double TotalPathLength { get; }
Visual Basic
Public ReadOnly Property TotalPathLength As Double
	Get
Visual C++
public:
property double TotalPathLength {
	double get ();
}
See Also
DividedPath Class
Autodesk.Revit.DB Namespace